taifuer/esp32-rlcd-firmware/sdkconfig.defaults
# ESP32-S3-RLCD-4.2 hardware defaults, based on the Waveshare ESP-IDF examples.
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_FATFS_LFN_HEAP=y
CONFIG_FATFS_MAX_LFN=127
CONFIG_FATFS_API_ENCODING_UTF_8=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
# Enable dynamic frequency scaling support. The application explicitly keeps
# automatic Light-sleep disabled and holds a max-frequency lock in NORMAL.
CONFIG_PM_ENABLE=y
# DFS is configured explicitly after settings and the initial battery sample.
# Automatic Light-sleep remains outside this release's safety boundary.
# CONFIG_PM_DFS_INIT_AUTO is not set
# CONFIG_FREERTOS_USE_TICKLESS_IDLE is not set
CONFIG_FREERTOS_HZ=1000
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_ESP_CONSOLE_SECONDARY_USB_SERIAL_JTAG=y
CONFIG_LWIP_SNTP_MAX_SERVERS=3
# Keep production diagnostics useful without compiling DEBUG or VERBOSE log
# statements into the firmware. Cloud credentials and request bodies must
# never be logged at any level.
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_DEFAULT_LEVEL=3
CONFIG_LOG_MAXIMUM_EQUALS_DEFAULT=y
CONFIG_LOG_MAXIMUM_LEVEL=3
# Online firmware updates authenticate the server with the built-in CA bundle.
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_FULL=y

# Push-to-talk offline Chinese command recognition. Only the compact
# MultiNet5 Q8 model is packed; wake word, VAD and noise-suppression models are
# intentionally excluded because this release never listens continuously.
CONFIG_MODEL_IN_FLASH=y
# CONFIG_MODEL_IN_SDCARD is not set
CONFIG_SR_NSN_WEBRTC=y
CONFIG_SR_VADN_WEBRTC=y
CONFIG_SR_MN_CN_MULTINET5_RECOGNITION_QUANT8=y
CONFIG_SR_MN_EN_NONE=y

# Project defaults for the temporary provisioning access point. Keep the
# password empty so each provisioning session receives a fresh random value.
CONFIG_RLCD_SETUP_AP_SSID="ESP32-RLCD"
CONFIG_RLCD_SETUP_AP_APPEND_DEVICE_ID=y
CONFIG_RLCD_SETUP_AP_PASSWORD=""
